### Lets build a strategy for real estate

In [176]:
import pandas as pd
import Quandl as qd

#### So, what governs the prices of homes, and do we need to do the research to find this out? Generally, no, you don't really need to do that digging, we know the factors. 

The factors for home prices are governed by: The economy, interest rates, and demographics. These are the three major influences in general for real estate value. 

Now, of course, if you're buying land, various other things matter, how level is it, are we going to need to do some work to the land before we can actually lay foundation, how is drainage etc. If there is a house, then we have even more factors, like the roof, windows, heating/AC, floors, foundation, and so on. We can begin to consider these factors later, but first we'll start at the macro level. You will see how quickly our data sets inflate here as it is, it'll blow up fast.

In [177]:
tx = qd.get("FMAC/HPI_TX")

In [178]:
tx.head()

                Value
Date
1975-01-31  32.618858
1975-02-28  32.953457
1975-03-31  33.533513
1975-04-30  34.368221
1975-05-31  34.620177

In [179]:
# Now this is how the data for the state of Texas looks like.

#### We're going to pull housing data for the 50 states first, but then we stand to try to gather other data as well.

## As you carry on with your data science career, you will learn various constants that just happen to be because people are logical and reasonable.

### In our case, we need to grab the data for all of the states. How might we do this? We need the ticker information i.e. "FMAC/HPI_STATE_NAME" so that we can pull the data using these tickers individually.

Do we need to grab every ticker manually still? 

No. Looking at this ticker, we see FMAC/HPI_TX. We can easily decypher this to FMAC = Freddie Mac. HPI = House Price Index. 

TX means Texas, the common 2-letter abbreviation for the state. 

From here, we can safely assume all of the tickers are built this way, so now we just need a list of the state abbreviations. We Google it, make a choice like This list of the 50 states. Now what?

###  Let's check out the read_html from Pandas. It's not being called "experimental" anymore, but I would still label this as expirimental. 

The standard and quality of the other IO modules is very high and dependable. This read_html is not quite up to par, but I still say it's very impressive and useful code, and just plain cool. 

The way it works is you just simply feed in a URL, and Pandas will extract the dataframe worthy date from tables into a dataframe. 
This means, unlike the other typical methods you will usually use, read_html ends up reading into a list of dataframes. This isn't the only one that is different, but it is different.

In [180]:
#First, in order to use read_html, we need html5lib. Open up cmd.exe or your terminal and do: pip install html5lib.

In [181]:
us_states = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')
print(us_states)

[               0               1               2                  3
0   Abbreviation      State Name         Capital     Became a State
1             AL         Alabama      Montgomery  December 14, 1819
2             AK          Alaska          Juneau    January 3, 1959
3             AZ         Arizona         Phoenix  February 14, 1912
4             AR        Arkansas     Little Rock      June 15, 1836
5             CA      California      Sacramento  September 9, 1850
6             CO        Colorado          Denver     August 1, 1876
7             CT     Connecticut        Hartford    January 9, 1788
8             DE        Delaware           Dover   December 7, 1787
9             FL         Florida     Tallahassee      March 3, 1845
10            GA         Georgia         Atlanta    January 2, 1788
11            HI          Hawaii        Honolulu    August 21, 1959
12            ID           Idaho           Boise       July 3, 1890
13            IL        Illinois     Springfield   December 3, 1818
14            IN         Indiana    Indianapolis  December 11, 1816
15            IA            Iowa      Des Moines  December 28, 1846
16            KS          Kansas          Topeka   January 29, 1861
17            KY        Kentucky       Frankfort       June 1, 1792
18            LA       Louisiana     Baton Rouge     April 30, 1812
19            ME           Maine         Augusta     March 15, 1820
20            MD        Maryland       Annapolis     April 28, 1788
21            MA   Massachusetts          Boston   February 6, 1788
22            MI        Michigan         Lansing   January 26, 1837
23            MN       Minnesota      Saint Paul       May 11, 1858
24            MS     Mississippi         Jackson  December 10, 1817
25            MO        Missouri  Jefferson City    August 10, 1821
26            MT         Montana          Helena   November 8, 1889
27            NE        Nebraska         Lincoln      March 1, 1867
28            NV          Nevada     Carson City   October 31, 1864
29            NH   New Hampshire         Concord      June 21, 1788
30            NJ      New Jersey         Trenton  December 18, 1787
31            NM      New Mexico        Santa Fe    January 6, 1912
32            NY        New York          Albany      July 26, 1788
33            NC  North Carolina         Raleigh  November 21, 1789
34            ND    North Dakota        Bismarck   November 2, 1889
35            OH            Ohio        Columbus      March 1, 1803
36            OK        Oklahoma   Oklahoma City  November 16, 1907
37            OR          Oregon           Salem  February 14, 1859
38            PA    Pennsylvania      Harrisburg  December 12, 1787
39            RI    Rhode Island      Providence       May 19, 1790
40            SC  South Carolina        Columbia       May 23, 1788
41            SD    South Dakota          Pierre   November 2, 1889
42            TN       Tennessee       Nashville       June 1, 1796
43            TX           Texas          Austin  December 29, 1845
44            UT            Utah  Salt Lake City    January 4, 1896
45            VT         Vermont      Montpelier      March 4, 1791
46            VA        Virginia        Richmond      June 25, 1788
47            WA      Washington         Olympia  November 11, 1889
48            WV   West Virginia      Charleston      June 20, 1863
49            WI       Wisconsin         Madison       May 29, 1848
50            WY         Wyoming        Cheyenne      July 10, 1890,                                                   0   \
0  v t e Political divisions of the United States...
1     v t e Political divisions of the United States
2                                                NaN
3                                             States
4                                                NaN
5                                   National capital
6                                                NaN
7                                      Large islands
8                                                NaN
9                                      Small islands

                                                  1   2       3   \
0     v t e Political divisions of the United States NaN  States
1                                                NaN NaN     NaN
2                                                NaN NaN     NaN
3  Alabama · Alaska · Arizona · Arkansas · Califo... NaN     NaN
4                                                NaN NaN     NaN
5                               District of Columbia NaN     NaN
6                                                NaN NaN     NaN
7  American Samoa · Guam · Northern Mariana Islan... NaN     NaN
8                                                NaN NaN     NaN
9  Baker Island · Howland Island · Jarvis Island ... NaN     NaN

                                                  4   5                 6   \
0  Alabama · Alaska · Arizona · Arkansas · Califo... NaN  National capital
1                                                NaN NaN               NaN
2                                                NaN NaN               NaN
3                                                NaN NaN               NaN
4                                                NaN NaN               NaN
5                                                NaN NaN               NaN
6                                                NaN NaN               NaN
7                                                NaN NaN               NaN
8                                                NaN NaN               NaN
9                                                NaN NaN               NaN

                     7   8              9   \
0  District of Columbia NaN  Large islands
1                   NaN NaN            NaN
2                   NaN NaN            NaN
3                   NaN NaN            NaN
4                   NaN NaN            NaN
5                   NaN NaN            NaN
6                   NaN NaN            NaN
7                   NaN NaN            NaN
8                   NaN NaN            NaN
9                   NaN NaN            NaN

                                                  10  11             12  \
0  American Samoa · Guam · Northern Mariana Islan... NaN  Small islands
1                                                NaN NaN            NaN
2                                                NaN NaN            NaN
3                                                NaN NaN            NaN
4                                                NaN NaN            NaN
5                                                NaN NaN            NaN
6                                                NaN NaN            NaN
7                                                NaN NaN            NaN
8                                                NaN NaN            NaN
9                                                NaN NaN            NaN

                                                  13
0  Baker Island · Howland Island · Jarvis Island ...
1                                                NaN
2                                                NaN
3                                                NaN
4                                                NaN
5                                                NaN
6                                                NaN
7                                                NaN
8                                                NaN
9                                                NaN  ,                                                 0  \
0  v t e Political divisions of the United States
1                                             NaN
2                                          States
3                                             NaN
4                                National capital
5                                             NaN
6                                   Large islands
7                                             NaN
8                                   Small islands

                                                   1
0                                                NaN
1                                                NaN
2  Alabama · Alaska · Arizona · Arkansas · Califo...
3                                                NaN
4                               District of Columbia
5                                                NaN
6  American Samoa · Guam · Northern Mariana Islan...
7                                                NaN
8  Baker Island · Howland Island · Jarvis Island ...  ]

In [182]:
# We don't need most of this data. Some of it is good.
us_states[0].head()

              0           1            2                  3
0  Abbreviation  State Name      Capital     Became a State
1            AL     Alabama   Montgomery  December 14, 1819
2            AK      Alaska       Juneau    January 3, 1959
3            AZ     Arizona      Phoenix  February 14, 1912
4            AR    Arkansas  Little Rock      June 15, 1836

Remember, right now, us_states is a list of dataframes, and us_states[0] is the first dataframe. 

To reference column 0 then, we do fiddy_states[0][0]. One is a list index, which returns a dataframe. The other is a column within the dataframe. 

Let's try that. Shall we?

In [183]:
type(us_states)

list

In [184]:
us_states[0][0].head()

0    Abbreviation
1              AL
2              AK
3              AZ
4              AR
Name: 0, dtype: object

Next, we notice the first item in column 0 is the word "abbreviation," which we don't want. We can single that out when we iterate through all of the items in column 0 by doing column 0 [1:]. 

As such, our list of abbreviations is us_states[0][0][1:], and we can iterate like so:

In [185]:
us_states[0][0][1:].head()

1    AL
2    AK
3    AZ
4    AR
5    CA
Name: 0, dtype: object

Perfect! Now, we remember why we're doing this at all in the first place: We are trying to build the "tickers" with the state abbreviations to acquire the housing price index for each state. Okay, we can build the ticker:

In [186]:
state_tickers = []
for state in us_states[0][0][1:]:
    state_tickers.append(' '.join(['FMAC/HPI_', state]))

In [187]:
state_tickers

[u'FMAC/HPI_ AL',
 u'FMAC/HPI_ AK',
 u'FMAC/HPI_ AZ',
 u'FMAC/HPI_ AR',
 u'FMAC/HPI_ CA',
 u'FMAC/HPI_ CO',
 u'FMAC/HPI_ CT',
 u'FMAC/HPI_ DE',
 u'FMAC/HPI_ FL',
 u'FMAC/HPI_ GA',
 u'FMAC/HPI_ HI',
 u'FMAC/HPI_ ID',
 u'FMAC/HPI_ IL',
 u'FMAC/HPI_ IN',
 u'FMAC/HPI_ IA',
 u'FMAC/HPI_ KS',
 u'FMAC/HPI_ KY',
 u'FMAC/HPI_ LA',
 u'FMAC/HPI_ ME',
 u'FMAC/HPI_ MD',
 u'FMAC/HPI_ MA',
 u'FMAC/HPI_ MI',
 u'FMAC/HPI_ MN',
 u'FMAC/HPI_ MS',
 u'FMAC/HPI_ MO',
 u'FMAC/HPI_ MT',
 u'FMAC/HPI_ NE',
 u'FMAC/HPI_ NV',
 u'FMAC/HPI_ NH',
 u'FMAC/HPI_ NJ',
 u'FMAC/HPI_ NM',
 u'FMAC/HPI_ NY',
 u'FMAC/HPI_ NC',
 u'FMAC/HPI_ ND',
 u'FMAC/HPI_ OH',
 u'FMAC/HPI_ OK',
 u'FMAC/HPI_ OR',
 u'FMAC/HPI_ PA',
 u'FMAC/HPI_ RI',
 u'FMAC/HPI_ SC',
 u'FMAC/HPI_ SD',
 u'FMAC/HPI_ TN',
 u'FMAC/HPI_ TX',
 u'FMAC/HPI_ UT',
 u'FMAC/HPI_ VT',
 u'FMAC/HPI_ VA',
 u'FMAC/HPI_ WA',
 u'FMAC/HPI_ WV',
 u'FMAC/HPI_ WI',
 u'FMAC/HPI_ WY']

In [ ]:
# Now that we have created a list of tickers, lets see what the list contains
state_tickers[1]

In our case with real estate investing, we're hoping to take the 50 dataframes with housing data and then just combine them all into one dataframe. 

We do this for multiple reasons. First, it is easier and just makes sense to combine these, but also it will result in less memory being used. Every dataframe has a date and value column. This date column is repeated across all the dataframes, but really they should all just share the one, effectively nearly halving our total column count.

There are four major ways of combining dataframes, which we'll begin covering now. The four major ways are: Concatenation, joining, merging, and appending. We'll begin with Concatenation. Here are some starting dataframes:

In [132]:
df1 = pd.DataFrame({'HPI':[80,85,88,89],
                    'Int_rate':[2, 3, 2, 4],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({'HPI':[80,89,88,85],
                    'Int_rate':[1, 3, 5, 7],
                    'US_GDP_Thousands':[50, 56, 60, 71]},
                   index = [2005, 2006, 2007, 2008])

df3 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'Low_tier_HPI':[50, 52, 50, 53]},
                   index = [2001, 2002, 2003, 2004])

In [133]:
df1

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55

In [134]:
df2

      HPI  Int_rate  US_GDP_Thousands
2005   80         1                50
2006   89         3                56
2007   88         5                60
2008   85         7                71

In [135]:
df3

      HPI  Int_rate  Low_tier_HPI
2001   80         2            50
2002   85         3            52
2003   88         2            50
2004   85         2            53

Notice there are two major changes between these. df1 and df3 have the same index, but they have some different columns. df2 and df3 have different indexes and some differing columns. With concatenation, we can talk about various methods of bringing these together. Let's try a simple concatenation:

In [136]:
df4 = pd.concat([df1,df2])
print(df4)

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55
2005   80         1                50
2006   89         3                56
2007   88         5                60
2008   85         7                71

Easy enough. The major difference between these was merely a continuation of the index, but they shared the same columns. Now they have become a single dataframe. In our case, however, we're curious about adding columns, not rows. What happens when we combine some shared and some new:

In [137]:
df5 = pd.concat([df1,df2,df3])
print(df5)

      HPI  Int_rate  Low_tier_HPI  US_GDP_Thousands
2001   80         2           NaN              50.0
2002   85         3           NaN              55.0
2003   88         2           NaN              65.0
2004   89         4           NaN              55.0
2005   80         1           NaN              50.0
2006   89         3           NaN              56.0
2007   88         5           NaN              60.0
2008   85         7           NaN              71.0
2001   80         2          50.0               NaN
2002   85         3          52.0               NaN
2003   88         2          50.0               NaN
2004   85         2          53.0               NaN

###### Not bad, we have some NaN (not a number), because this data didn't exist for that index, but all of our data is indeed here.

Those are the basics of concatenation, next up, let's cover appending. Appending is like the first example of concatenation, only a bit more forceful in that the dataframe will simply be appended to, adding to rows. Let's show an example of how it usually works, but also show where it could possibly go wrong:

In [138]:
df6 = df1.append(df2)
print(df6)

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55
2005   80         1                50
2006   89         3                56
2007   88         5                60
2008   85         7                71

That's what we expect with an append. In most cases, you are going to do something like this, as if you're inserting a new row in a database. 

Dataframes were not really made to be appended efficiently, they are meant more so to be manipulated based on their starting data, but you can append if you need to. What happens when we append data with the same index?

In [139]:
df7 = df1.append(df3)
print(df7)

      HPI  Int_rate  Low_tier_HPI  US_GDP_Thousands
2001   80         2           NaN              50.0
2002   85         3           NaN              55.0
2003   88         2           NaN              65.0
2004   89         4           NaN              55.0
2001   80         2          50.0               NaN
2002   85         3          52.0               NaN
2003   88         2          50.0               NaN
2004   85         2          53.0               NaN

Well, that's unfortunate. Some people ask why both concatenation and append exit. That's why. It's far more efficient here to combine these dataframes since the columns shared contain the same data and same index. One more example is to append possibly a series. You're more likely to be appending a series than whole dataframes given the nature of append. We have not spoken about series to this point. A series is basically a single-columned dataframe. A series does have an index, but, if you convert it to a list, it will be just those values. Whenever we say something like df['column'], the return is a series.

In [140]:
s = pd.Series([80,2,50], index=['HPI','Int_rate','US_GDP_Thousands'])
df8 = df1.append(s, ignore_index=True)
print(df8)

   HPI  Int_rate  US_GDP_Thousands
0   80         2                50
1   85         3                55
2   88         2                65
3   89         4                55
4   80         2                50

We have to ignore the index when appending a series, because that is the law, unless the series has a name.

Here, we have covered Concatenating and Appending dataframes in Pandas. Next, we're going to talk about joining and merging dataframe

In [141]:
# Next up, merging.
# Before that, let us rename the year column (which doesn't have the name already)

In [142]:
df1

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55

In [143]:
df1.rename(columns={' ': 'Year'}, inplace=True)

In [144]:
df1

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55

In [145]:
# Before we go ahead and merge these dataframes, let's rename the index column
df1.index.name = 'Year'
df2.index.name = 'Year'
df3.index.name = 'Year'

In [146]:
# That didn't work as intended. So, let's assign the index column to a newly created column called 'Year' in each dataframe
# and then, make this new colum the index
df1['Year'] = df1.index
df2['Year'] = df2.index
df3['Year'] = df3.index

In [147]:
# Lets see if that worked
df1

      HPI  Int_rate  US_GDP_Thousands  Year
Year
2001   80         2                50  2001
2002   85         3                55  2002
2003   88         2                65  2003
2004   89         4                55  2004

In [148]:
# Ok, now let's set Year as the index
df1.set_index('Year', inplace=True)

In [149]:
df1

      HPI  Int_rate  US_GDP_Thousands
Year
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   89         4                55

In [150]:
# That worked a charm. Now let's do that for the other two datframes as well.
df2.set_index('Year', inplace=True)
df3.set_index('Year', inplace=True)

In [151]:
# Now, we'll use a little trick to make the index column look and work as a normal column
df1.reset_index(level=0, inplace=True)

In [152]:
df1

   Year  HPI  Int_rate  US_GDP_Thousands
0  2001   80         2                50
1  2002   85         3                55
2  2003   88         2                65
3  2004   89         4                55

In [153]:
# That worked again. Let's do it for df2 and df3
df2.reset_index(level=0, inplace=True)
df3.reset_index(level=0, inplace=True)

In [154]:
# Now, let's merge on Year
pd.merge(df1, df2, on='Year')

Empty DataFrame
Columns: [Year, HPI_x, Int_rate_x, US_GDP_Thousands_x, HPI_y, Int_rate_y, US_GDP_Thousands_y]
Index: []

In [155]:
# Looks like df1 and df2 have no year data in common.
# Lets try df2 and df3

pd.merge(df2, df3, on='Year')

Empty DataFrame
Columns: [Year, HPI_x, Int_rate_x, US_GDP_Thousands, HPI_y, Int_rate_y, Low_tier_HPI]
Index: []

In [156]:
# Nope, that didn't work either. Let's look at our dataframes before we merge them.

In [157]:
df1

   Year  HPI  Int_rate  US_GDP_Thousands
0  2001   80         2                50
1  2002   85         3                55
2  2003   88         2                65
3  2004   89         4                55

In [158]:
df2

   Year  HPI  Int_rate  US_GDP_Thousands
0  2005   80         1                50
1  2006   89         3                56
2  2007   88         5                60
3  2008   85         7                71

In [159]:
df3

   Year  HPI  Int_rate  Low_tier_HPI
0  2001   80         2            50
1  2002   85         3            52
2  2003   88         2            50
3  2004   85         2            53

In [160]:
# df1 and df3 have common year data. Hence:

pd.merge(df1, df3, on='Year')

   Year  HPI_x  Int_rate_x  US_GDP_Thousands  HPI_y  Int_rate_y  Low_tier_HPI
0  2001     80           2                50     80           2            50
1  2002     85           3                55     85           3            52
2  2003     88           2                65     88           2            50
3  2004     89           4                55     85           2            53

In [161]:
# Wohooo!!!! So we have learnt merging as well. Now, let's try the hows of merging.
# They are fairly similar to sql commands and intuitive.
left_merge = pd.merge(df1, df2, on='HPI', how='left')
left_merge.set_index('HPI', inplace=True)
left_merge

,Year_x,Int_rate_x,US_GDP_Thousands_x,Year_y,Int_rate_y,US_GDP_Thousands_y
HPI,,,,,,
80,2001,2,50,2005,1,50
85,2002,3,55,2008,7,71
88,2003,2,65,2007,5,60
89,2004,4,55,2006,3,56

The resultant dataframe has the two merged dataframes side by side, with df1 on the left and df2 on the right.
Specifying the how as 'left' makes the index of the combined dataframe similar 
to the dataframe on the left in the command i.e df1. Like you can see, the rows of df2 in the merged dataframe
have realigned to match with the resulting new index.

In [162]:
df1

   Year  HPI  Int_rate  US_GDP_Thousands
0  2001   80         2                50
1  2002   85         3                55
2  2003   88         2                65
3  2004   89         4                55

In [163]:
df2

   Year  HPI  Int_rate  US_GDP_Thousands
0  2005   80         1                50
1  2006   89         3                56
2  2007   88         5                60
3  2008   85         7                71

In [164]:
outer_merge = pd.merge(df1, df2, on='HPI', how='outer')
outer_merge.set_index('HPI', inplace=True)
outer_merge

,Year_x,Int_rate_x,US_GDP_Thousands_x,Year_y,Int_rate_y,US_GDP_Thousands_y
HPI,,,,,,
80,2001,2,50,2005,1,50
85,2002,3,55,2008,7,71
88,2003,2,65,2007,5,60
89,2004,4,55,2006,3,56

As you can see, the outer join creaates a full join, with union of keys (index).

In [165]:
# Let's try right merge now. Before that, lets print the two dataframes again.
df1

   Year  HPI  Int_rate  US_GDP_Thousands
0  2001   80         2                50
1  2002   85         3                55
2  2003   88         2                65
3  2004   89         4                55

In [166]:
df2

   Year  HPI  Int_rate  US_GDP_Thousands
0  2005   80         1                50
1  2006   89         3                56
2  2007   88         5                60
3  2008   85         7                71

In [167]:
right_merge = pd.merge(df1, df2, on='HPI', how='right')
right_merge.set_index('HPI', inplace=True)
right_merge

,Year_x,Int_rate_x,US_GDP_Thousands_x,Year_y,Int_rate_y,US_GDP_Thousands_y
HPI,,,,,,
80,2001,2,50,2005,1,50
85,2002,3,55,2008,7,71
88,2003,2,65,2007,5,60
89,2004,4,55,2006,3,56

As you can see, the  resultant dataframe is ordered according to the index of df2 in ascending order
80 -> 2005
85 -> 2008
88 -> 2007
89 -> 2006

In [170]:
# Finally, "inner" is the intersection of keys, basically just what is shared between all the dataframes. 
inner_merge = pd.merge(df1, df2, on='HPI', how='inner')
inner_merge.set_index('HPI', inplace=True)
inner_merge

,Year_x,Int_rate_x,US_GDP_Thousands_x,Year_y,Int_rate_y,US_GDP_Thousands_y
HPI,,,,,,
80,2001,2,50,2005,1,50
85,2002,3,55,2008,7,71
88,2003,2,65,2007,5,60
89,2004,4,55,2006,3,56

In [171]:
# Since, we don't see a difference here, let's merge df1 and df3

In [172]:
df3

   Year  HPI  Int_rate  Low_tier_HPI
0  2001   80         2            50
1  2002   85         3            52
2  2003   88         2            50
3  2004   85         2            53

In [173]:
inner_merge = pd.merge(df1, df3, on='HPI', how='inner')
inner_merge.set_index('HPI', inplace=True)
inner_merge

     Year_x  Int_rate_x  US_GDP_Thousands  Year_y  Int_rate_y  Low_tier_HPI
HPI
80     2001           2                50    2001           2            50
85     2002           3                55    2002           3            52
85     2002           3                55    2004           2            53
88     2003           2                65    2003           2            50

In [174]:
# The row '89' is missing as you can see. Cos this is just an intersection of keys (indexs)

### Need a little cheat sheet?

##### Left - equal to left outer join SQL - use keys from left frame only
##### Right - right outer join from SQL- use keys from right frame only.
##### Outer - full outer join - use union of keys
##### Inner - use only intersection of keys.
#### Each of these has its own reasoning, but, as you can see, the default option is "inner."